var despacito = [/*每两行为同一时间的乐谱，第一行为低音，第二行为高音
					time:秒, lx :低音(左手), rx :高音(右手), 空行:一小节结束*/
/*四分音符=180, 八分：0.165、八分加长：0.2475、四分：0.33、四分加长：0.495、全音：1.32*/

	{/*时值*/"time" : "0.495" , /*高音*/"r0" : "small2-D" , "r1" : "small1-A" , "r2" : "small1-F"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-F"},
	{/*时值*/"time" : "0.495" , /*高音*/"r0" : "small2-C#"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-F"},

	{/*时值*/"time" : "1.32" , /*高音*/"r0" : "small1-B"},

	{/*时值*/"time" : "0.66" , /*高音*/"r0" : "null"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-C#"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-A"},

	{/*时值*/"time" : "1.32" , /*高音*/"r0" : "small1-G"},
/*5*/
	{/*时值*/"time" : "0.66" , /*高音*/"r0" : "null"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-C#"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-C#"},

	{/*时值*/"time" : "1.32" , /*高音*/"r0" : "small2-D"},

	{/*时值*/"time" : "0.66" , /*高音*/"r0" : "null"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-C#"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-E"},

	{/*时值*/"time" : "1.32" , /*高音*/"r0" : "small2-C#"},
/*9*/
	{/*时值*/"time" : "0.495" , /*高音*/"r0" : "small2-D" , "r1" : "small1-A" , "r2" : "small1-F"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-F"},
	{/*时值*/"time" : "0.495" , /*高音*/"r0" : "small2-C#"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-F"},

	{/*时值*/"time" : "0.66" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "null"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-F"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-C#"},

	{/*时值*/"time" : "0.2475" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.2475" , /*高音*/"r0" : "small2-E"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.2475" , /*高音*/"r0" : "small2-C#"},
	{/*时值*/"time" : "0.2475" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-A"},

	{/*时值*/"time" : "0.495" , /*高音*/"r0" : "small1-G"},
	{/*时值*/"time" : "0.495" , /*高音*/"r0" : "small2-D"},
/*13*/
	{/*时值*/"time" : "0.99" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.66" , /*高音*/"r0" : "null"},

	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small1-A"},
	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small1-A"},

	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small1-A"},
	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-E"},

	{/*时值*/"time" : "0.99" , /*高音*/"r0" : "small2-C#"},
	{/*时值*/"time" : "0.66" , /*高音*/"r0" : "null"},
/*17*/
	{/*时值*/"time" : "1.32" , /*高音*/"r0" : "null"},

	{/*时值*/"time" : "0.66" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "null"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-F"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-C#"},

	{/*时值*/"time" : "0.2475" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.2475" , /*高音*/"r0" : "small2-E"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.2475" , /*高音*/"r0" : "small2-C#"},
	{/*时值*/"time" : "0.2475" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-A"},

	{/*时值*/"time" : "0.2475" , /*高音*/"r0" : "small1-G"},
	{/*时值*/"time" : "0.2475" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small2-E"},
/*21*/
	{/*时值*/"time" : "0.66" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.66" , /*高音*/"r0" : "null"},

	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small1-A"},
	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small1-A"},

	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small1-A"},
	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-E"},

	{/*时值*/"time" : "0.825" , /*高音*/"r0" : "small2-C#"},
	{/*时值*/"time" : "0.66" , /*高音*/"r0" : "null"},
/*25*/
	{/*时值*/"time" : "0.495" , /*高音*/"r0" : "small2-D" , "r1" : "small1-A" , "r2" : "small1-F"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-F"},
	{/*时值*/"time" : "0.495" , /*高音*/"r0" : "small2-C#"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-F"},

	{/*时值*/"time" : "0.66" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-C#"},

	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-C#"},
	{/*时值*/"time" : "0.2475" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.2475" , /*高音*/"r0" : "small2-C#"},
	{/*时值*/"time" : "0.2475" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.2475" , /*高音*/"r0" : "small2-C#"},

	{/*时值*/"time" : "0.66" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-C#"},
/*29*/
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-C#"},
	{/*时值*/"time" : "0.2475" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.2475" , /*高音*/"r0" : "small2-C#"},
	{/*时值*/"time" : "0.2475" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.2475" , /*高音*/"r0" : "small2-E"},

	{/*时值*/"time" : "0.66" , /*高音*/"r0" : "small1-A"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-A"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-A"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-A"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-A"},

	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-C#"},
	{/*时值*/"time" : "0.2475" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.2475" , /*高音*/"r0" : "small2-C#"},
	{/*时值*/"time" : "0.2475" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.2475" , /*高音*/"r0" : "small2-E"},

	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small2-E"},
	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small2-C#"},
	{/*时值*/"time" : "0.66" , /*高音*/"r0" : "null"},
/*33*/
	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "null"},
	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "null"},

	{/*时值*/"time" : "0.66" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-C#"},

	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-C#"},
	{/*时值*/"time" : "0.2475" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.2475" , /*高音*/"r0" : "small2-C#"},
	{/*时值*/"time" : "0.2475" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.2475" , /*高音*/"r0" : "small2-C#"},

	{/*时值*/"time" : "0.66" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-C#"},
/*37*/
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-C#"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-C#"},
	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-E"},

	{/*时值*/"time" : "0.825" , /*高音*/"r0" : "small1-A"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-A"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-A"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-A"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-A"},

	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-C#"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-C#"},
	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-E"},

	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small2-E"},
	{/*时值*/"time" : "0.495" , /*高音*/"r0" : "small2-C#"},
	{/*时值*/"time" : "0.66" , /*高音*/"r0" : "null"},
/*41*/
	{/*时值*/"time" : "0.66" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.66" , /*高音*/"r0" : "small2-C#"},

	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small1-F"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-F"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-F"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-F"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-F"},

	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-F"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-A"},
	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-A"},

	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.495" , /*高音*/"r0" : "small1-G"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-G"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-G"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-G"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-G"},
/*45*/
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-G"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-C#"},

	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.495" , /*高音*/"r0" : "small1-A"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-A"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-A"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-A"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-A"},

	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-A"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-E"},

	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small2-E"},
	{/*时值*/"time" : "0.495" , /*高音*/"r0" : "small2-C#"},
	{/*时值*/"time" : "0.66" , /*高音*/"r0" : "null"},
/*49*/
{/*时值*/"time" : "0.66" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.66" , /*高音*/"r0" : "small2-C#"},

	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small1-F"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-F"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-F"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-F"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-F"},

	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-F"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-A"},
	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-A"},

	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.495" , /*高音*/"r0" : "small1-G"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-G"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-G"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-G"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-G"},
/*53*/
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-G"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small1-B"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-C#"},

	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.495" , /*高音*/"r0" : "small1-A"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-A"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-A"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-A"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-A"},

	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-A"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small2-E"},

	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small2-E"},
	{/*时值*/"time" : "0.495" , /*高音*/"r0" : "small2-C#"},
	{/*时值*/"time" : "0.66" , /*高音*/"r0" : "null"},
/*57*/
	{/*时值*/"time" : "0.495" , /*高音*/"r0" : "small2-D" , "r1" : "small1-A" , "r2" : "small1-F"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-F"},
	{/*时值*/"time" : "0.495" , /*高音*/"r0" : "small2-C#"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small1-F"},

	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-F#"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-E"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-F#"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-E"},
	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small1-F#"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-E"},

	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small2-F#"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-E"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-F#"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-E"},
	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small2-F#"},
	{/*时值*/"time" : "0.165" , /*高音*/"r0" : "small2-G"},

	{/*时值*/"time" : "0.33" , /*高音*/"r0" : "small2-G"},
	{/*时值*/"time" : "0.495" , /*高音*/"r0" : "small2-D"},
	{/*时值*/"time" : "0.66" , /*高音*/"r0" : "null"},
/*61*/
	



	];
